# HArea

## Description
Function HArea returns the area of the referenced object.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION HArea(h : HANDLE) : REAL;
```

```python

def vs.HArea(h):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
```diff
- HArea is obsolete as of VectorWorks12.5
```

Availability: from MiniCAD
## Category
* Object Info